<template>
  <div class="ui container">
    <div class="ui active tab">
      <div id="ruleContainer" class="ui main container" style="margin-top: 2em">
        <h2 class="ui dividing header">SPARCS 회칙</h2>
        <h3 class="ui header">제 1 장 총칙</h3>
        <p>
          제 1 조 (명칭) <br />
          본회는 System Programmers' Association for Researching Computer Systems (SPARCS)라 한다.
        </p>
        <p>
          제 2 조 (목적) <br />
          본회는 컴퓨터 시스템에 관한 지식을 축적, 공유하고, 그 지식을 토대로 KAIST 내 및 국내 컴퓨터 운영에 도움을 주는 활동을 목적으로 한다.
        </p>
        <h3 class="ui header">제 2 장 회원 구성</h3>
        <p>
          제 3 조 (회원) <br />
          본회의 회원은 다음과 같이 구성된다. <br />
          <ol>
            <li>
              준회원 <br />
              가. 본원 학부에 소속된 자로서 본회에서 실시하는 신입 회원 선발 절차를 통과한 자.
            </li>
            <li>
              정회원 <br />
              가. 본원 학부에 소속된 자로서 준회원으로서 신입 회원 선발 위원회에서 정한 승급 절차를 이수하였으며 준비 기간 동안 성실히 활동했다고 판단되어 총회에서 정회원의 자격을 부여한 자.
            </li>
            <li>
              명예회원 <br />
              가. 정회원으로서 본원의 학부를 졸업한 자. <br />
              나. 본회 회원의 추천을 받은 자.
            </li>
          </ol>
        </p>
        <p>
          제 4 조 (회원의 권리 및 의무) <br />
          <ol>
            <li>
              정회원 및 준회원은 본회의 모든 활동에 참여할 권리와 의무를 가진다.
            </li>
            <li>
              정회원은 임원의 선거권과 피선거권을 가진다.
            </li>
            <li>
              준회원 및 정회원은 일정 금액의 회비를 납부한다.
            </li>
            <li>
              정회원은 정기모임에서 발의된 의견의 의결권을 가진다.
            </li>
          </ol>
        </p>
        <p>
          제 5 조 (회원의 임기) <br />
          <ol>
            <li>
              정회원의 임기는 본원의 학부를 졸업할 때 까지이다.
            </li>
            <li>
              명예회원의 임기는 평생이다.
            </li>
          </ol>
        </p>
        <h3 class="ui header">제 3 장 임원</h3>
        <p>
          제 6 조 (회장) <br />
          <ol>
            <li>
              본회를 대표하며, 총회 및 임원회의 의장이 된다.
            </li>
            <li>
              정기모임에서 사회자가 되거나 부회장을 사회자로 선임할 수 있다.
            </li>
            <li>
              본회의 대외활동에서 대표권을 가진다.
            </li>
            <li>임시총회 및 임원회를 소집, 주관할 수 있다.</li>
            <li>본회의 회칙 개정을 발의할 수 있다.</li>
            <li>회칙의 집행과 총회 및 임원회에서 결정된 사항의 집행을 주관한다.</li>
            <li>정기총회에서 부회장, 총무를 임명할 권리를 가진다.</li>
            <li>준회원 및 정회원 선발과 회원 제명에 대해 최종 결정권을 가진다.</li>
            <li>정기모임에서 서기를 임명할 수 있다.</li>
          </ol>
        </p>
        <p>
          제 7 조 (부회장) <br />
          <ol>
            <li>부회장은 회장을 보좌하며, 회장의 부재 시 그 업무 및 권한을 대행한다.</li>
            <li>회장의 요청에 의해 정기모임에서 사회자가 될 수 있다.</li>
            <li>본회의 대외활동에서 대표권을 가진다.</li>
            <li>회칙의 집행과 총회 및 임원회에서 결정된 사항의 집행을 주관한다.</li>
            <li>동아리에서 진행되고 있는 프로젝트 및 스터디를 관리한다.</li>
          </ol>
        </p>
        <p>
          제 8 조 (총무) <br />
          <ol>
            <li>회비의 수납, 관리, 지출 기타 일체의 금전관리 및 본회의 모든 재산을 관리한다.</li>
            <li>회계 장부를 기록, 정리하며, 예산 및 결산을 보고한다.</li>
            <li>정기모임, 워크샵 등 SPARCS 회원 전체가 참여하는 활동을 회원들에게 개인적으로 공지하는 것을 담당한다.</li>
          </ol>
        </p>
        <p>
          제 9 조 (임원의 임기) <br />
            <ol>
              <li>각 임원의 임기는 그를 선출한 총회의 익일부터 차기 임원을 선출하는 총회 당일까지의 1년이다.</li>
              <li>임원의 결원이 생기면, 임시총회를 통해 선출하며 그 임기는 전임자의 잔여기간이다.</li>
            </ol>
        </p>
        <h3 class="ui header">제 4 장 시스템/서비스 관리자</h3>
        <p>
          제 10 조 (Wheel) <br />
          <ol>
            <li>본회에서 운영하는 전산 기기를 관리한다.</li>
            <li>(자격) 정회원 중에서 wheel 세미나를 수료하였으며 wheel장의 동의하에 임명된 자.</li>
            <li>현재 Wheel의 자격을 가지는 자 중 1인을 wheel장으로 하며, 전 wheel장이 임명한다.</li>
            <li>Wheel장은 wheel 그룹원을 wheel 그룹에서 제외시킬 수 있다.</li>
            <li>Wheel장의 임기는 그를 임명한 총회의 익일부터 차기 wheel장을 임명하는 총회 당일까지의 1년이다.</li>
          </ol>
        </p>
        <p>
          제 11 조 (SYSOP) <br />
          <ol>
            <li>본회에서 운영하는 서비스를 관리한다.</li>
            <li>서비스마다 SYSOP을 둔다.</li>
            <li>기존 서비스의 새 SYSOP은 해당 서비스의 전 SYSOP이 임명한다.</li>
            <li>새 서비스의 경우 프로젝트 관리자와 임원회가 SYSOP을 임명한다.</li>
            <li>SYSOP은 해당 서비스 머신에 한해서 wheel과 동등한 권한을 가진다.</li>
          </ol>
        </p>
        <p>제 12 조 (Wheel과 SYSOP의 임기) <br/> 삭제</p>
        <h3 class="ui header">제 5 장 활동</h3>
        <p>
          제 13 조 (정기모임) <br/>
          <ol>
            <li>학기 중 매주 1회 정기모임을 가진다.</li>
            <li>세미나와 프로젝트의 주제 및 계획에 관해 토론한다.</li>
            <li>그 외 각종 본회의 전달 사항이나 활동을 논한다.</li>
            <li>정기모임에서 회장이 임명한 서기는 논의된 내용을 바탕으로 정기회의록을 작성한다.</li>
          </ol>
        </p>
        <p>
          제 14 조 (세미나) <br/>
          <ol>
            <li>세미나는 정기 세미나와 비정기 세미나로 이루어진다.</li>
            <li>세미나의 주제 및 발표자는 정기모임에서 결정한다.</li>
            <li>정기 세미나는 신입생 세미나, wheel 세미나, 여름학기 정기 세미나로 이루어진다.</li>
            <li>(신입생 세미나) 준회원을 선발한 뒤 정해진 교육 과정에 의해 시행된다.</li>
            <li>(wheel 세미나) wheel에 지원하는 정회원을 대상으로 여름학기에 시행된다.</li>
          </ol>
        </p>
        <p>
          제 15 조 (프로젝트) <br/>
          <ol>
            <li>프로젝트의 주제는 정기 모임에서 결정한다. 단, 학술적으로 가치가 있거나, 원내 및 국내 컴퓨터 시스템 사용자에게 도움이 되는 것으로 제한한다.</li>
            <li>프로젝트 팀을 구성해서 수행하며, 각 팀에는 1인의 관리자를 둔다.</li>
            <li>프로젝트 관리자는 정기모임에서 프로젝트의 진행 상황을 보고할 의무가 있다.</li>
          </ol>
        </p>
        <p>
          제 16 조 (스터디) <br />
          <ol>
            <li>스터디는 정기 모임에서 스터디 발제자에 의해 제안, 모집되며 스터디 주제는 특별한 제약을 두지 않는다.</li>
            <li>스터디 발제자 또는 스터디원 중 한 명이 스터디 장을 한다.</li>
            <li>스터디 장은 정기모임에서 스터디의 진행 상황을 보고할 의무가 있다.</li>
          </ol>
        </p>
        <h3 class="ui header">제 6 장 회원 관리</h3>
        <p>
          제 17 조 (신입 회원 선발) <br />
          <ol>
            <li>(정기모집) 매년 봄학기 개강 전 임원회를 포함하는 신입 회원 선발 위원회를 구성한다. 위원회의 임기는 한 학기이다.</li>
            <li>(정기모집) 신입 회원 선발 위원회에서는 신입 회원 선발 절차, 준비기간, 정회원 승급 절차를 결정한다.</li>
            <li>(정기모집) 신입 회원 선발은 개강 후 3주 이내에 신입회원 선발 위원회에서 정한 절차를 따른다. </li>
            <li>(정기모집) 정회원 승급은 신입 회원 선발 위원회에서 정한 절차를 따른다. 대신 총회에서 회원 과반수의 동의를 얻은 경우에 한해 타 절차로 대체할 수 있다.</li>
            <li>(정기모집) 가을학기에도 1~4 항을 준용하여 회원을 모집할 수 있다.</li>
            <li>(추가모집) 임시총회를 거쳐 비정기적으로 추가모집을 할 수 있다.</li>
            <li>신입 회원의 규모는 신입 회원 선발 위원회에서 정한다.</li>
            <li>신입 회원은 신입 회원 선발 절차 합격 후 준회원으로서 신입생 선발 과정에서 정한 준비기간을 가진다.</li>
          </ol>
        </p>
        <p>
          제 18 조 (신입 회원 선발 절차 응시 자격) <br/>
          <ol>
            <li>KAIST의 학사 과정으로 재학 중인 자.</li>
          </ol>
        </p>
        <p>
          제 19 조 (회원 징계) <br/>
          <ol>
            <li>재학학기 6학기 이내 혹은 동아리 활동학기 기준, 4학기 이내의 회원이 정당한 사유 없이 한 학기 동안 정모의 1/2 이상을 불참할 시, 또는 준회원이 정회원으로 승급하지 못할 시 제명안을 정기(임시)총회에 상정한다.</li>
            <li>제명안에 이름을 올린 회원이 정기 및 임시총회에서 동아리 활동을 지속할 것을 표명한 경우, 경고 1회로 대체할 수 있다.</li>
            <li>임원회에 의해 회원 자격 미달로 판단된 회원에게는 임원회에서 적절한 근거를 제시하여 총회에서 제명안에 상정할 수 있다.</li>
            <li>동아리 활동학기 기준, 최근 2학기 이내에 누적된 경고가 2회 이상 부과되면 해당 회원을 제명한다.</li>
            <li>제명안에 이름을 올린 회원은 정기(임시)총회에서 제명한다.</li>
          </ol>
        </p>
        <p>
          제 20 조 (회원 활동) <br/>
          <ol>
            <li>정회원이 재학 중 정당한 사유로 동아리 활동에 참여할 수 없을 것이라 판단되는 경우 임원회에 비활동 여부를 신청할 수 있다.</li>
            <li>비활동 여부의 신청 기간은 동아리 연합회에 회원 명단을 제출하기 전으로 한다.</li>
            <li>임원회는 비활동 여부를 요청한 회원의 사유가 정당하다고 판단되는 경우 해당 학기에 회원을 비활동 회원으로 변경할 수 있다.</li>
            <li>비활동 회원의 경우 정기모임에 참석해야 하는 의무와 회비 납부가 면제된다. 따라서 정기모임 불참으로 인하여 제명안에 올라가지 않는다.</li>
            <li>정회원이 휴학을 하게 되는 경우 비활동 회원으로 생각한다.</li>
            <li>비활동 회원이 아닌 정회원을 활동 회원이라 칭한다. </li>
          </ol>
        </p>
        <h3 class="ui header">제 7 장 임원의 선출 및 탄핵</h3>
        <p>
          제 21 조 (회장 선출) <br/>
          <ol>
            <li>회장의 선출 방법은 정기총회에 참여한 활동 회원이 참여하는 선거이다.</li>
            <li>회장 선거의 의사정족수는 활동 회원 수의 2/3이다.</li>
            <li>회장의 선출은 정기총회에 참석한 활동회원의 과반수 득표로 선출된다. 과반수 득표가 나오지 않는 경우 최고 득표자 2인을 재투표하여 그 중 다수득표자를 회장으로 한다.</li>
            <li>회장 후보로 선출 가능한 자는 임원 임기 동안 학부에 재학 예정이며 성실히 활동할 수 있는 회원으로 제한한다.</li>
            <li>회장 후보의 선출은 자진 선출과 활동회원의 추천을 우선한다. 이 때 후보가 없을 경우 임원회에서 회장 후보를 지명한다.</li>
          </ol>
        </p>
        <p>
          제 22 조 (기타 임원 선출) <br/>
          <ol>
            <li>부회장과 총무의 자격은 임원 임기 동안 학부에 재학 예정이며 성실히 활동할 수 있는 회원으로 제한한다.</li>
            <li>보회장은 정기총회 이후 1일 이내에 회장이 임명한 자로 한다.</li>
            <li>총무는 정기총회 이후 1일 이내에 회장이 임명한 자로 한다.</li>
            <li>회장은 부회장과 총무가 임명된 후 1일 이내로 공지할 의무가 있다.</li>
          </ol>
        </p>
        <p>
          제 23 조 (임원의 탄핵)
          <ol>
            <li>탄핵 소추 발의 <br/>
            가. 탄핵 소추의 발의는 정회원 1/4 이상에 의해 임시총회를 통해 이루어진다.</li>
            <li>탄핵 의결 <br/>
            가. 임원에 대한 탄핵은 총회에서 정회원 2/3 이상의 참석과 참석인원 과반수의 의결로 이루어진다.</li>
          </ol>
        </p>
        <h3 class="ui header">제 8 장 재정</h3>
        <p>
          제 24 조 (회계연도) <br/>
          <ol>
            <li>본회의 회계연도는 임원단의 임기 시작일부터 임기 종료일까지로 한다.</li>
            <li>예산의 편성, 집행, 결산은 회계연도에 의하여 행한다.</li>
          </ol>
        </p>
        <p>
          제 25 조 (예산 편성) <br/>
          <ol>
            <li>본회의 재정은 정기회비, 임시회비, 동아리 지원금, 프로젝트 수익금 및 기타 수익금으로 한다.</li>
          </ol>
        </p>
        <p>
          제 26 조 (예산 집행) <br />
          <ol>
            <li>본회의 예산은 정기모임 또는 임원회에 의해서 결정된 사업에 집행된다.</li>
            <li>모든 재정 집행은 회장의 승인하에 이루어지며, 총무는 지출내용을 보고받고 확인하여 기록한다.</li>
            <li>보유한 예산은 전액 은행에 예치하여야 한다.</li>
            <li>예산 집행 시 일체의 전표에 대해 영수증을 첨부하여야 한다.</li>
          </ol>
        </p>
        <p>
          제 27 조 (결산) <br />
          <ol>
            <li>총무는 정기총회에서 당 회계연도의 결산을 보고하고 승인을 얻어야 한다.</li>
          </ol>
        </p>
        <h3 class="ui header">제 9 장 회의</h3>
        <p>
          제 28 조 (정기총회) <br />
          <ol>
            <li>매년 가을학기 종강 2주 전에 정기총회를 한다.</li>
            <li>정기 총회의 내용은 다음과 같다.<br/>
            가. 회장의 활동 보고<br/>
            나. 총무의 결산 보고<br/>
            다. 차기 회장 및 임원의 선출<br />
            라. 차기 wheel장 임명
          </li>
          </ol>
        </p>
        <p>
          제 29 조 (임시총회)
          <ol>
            <li>정기모임에서 임원회 또는 정회원 1/4 이상의 발의에 의해 소집된다.</li>
            <li>임시총회에서의 의결은 회칙에서 따로 정하지 않는 한, 정회원 과반수 참석, 참석인원 과반수 찬성으로 이루어진다.</li>
          </ol>
        </p>
        <p>
          제 30 조 (임원회)
          <ol>
            <li>회장을 포함한 모든 임원으로 구성된다.</li>
            <li>회칙에서 정한 일 및 총회에서 위임된 일을 집행한다.</li>
          </ol>
        </p>
        <h3 class="ui header">제 10 장 회칙 개정</h3>
        <p>
          제 31 조 (회칙 개정 발의)
          <ol>
            <li>임시총회의 소집을 통해 이루어진다.</li>
            <li>정기총회의 소집을 통해 이루어진다.</li>
          </ol>
        </p>
        <p>
          제 32 조 (회칙 개정)
          <ol>
            <li>임시총회 또는 정기총회에서 정회원 2/3 이상의 참석과 참석인원 과반수 찬성으로 이루어진다.</li>
            <li>회장은 개정된 회칙을 즉시 공표하며, 새 회칙은 공표 즉시 효력을 발생한다.</li>
          </ol>
        </p>
      <h2 class="ui dividing header">참고</h2>
      <ul>
        <li><a class="rules" href="http://sparcs.org/media/files/20090504-rules.pdf">2009년 5월 4일 회칙 개정 내역</a></li>
        <li><a class="rules" href="http://sparcs.org/media/files/20100927-rules.pdf">2010년 9월 27일 회칙 개정 내역</a></li>
        <li><a class="rules" href="http://sparcs.org/media/files/20130429-rules.pdf">2013년 4월 29일 회칙 개정 내역</a></li>
      </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'rules',
};
</script>

<style>
#ruleContainer{
   padding-top: 95px;
}
.rules {
  color: black !important;
}
</style>
